MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP32GS504/mcu.h
#define ADCORE1L ADCORE1L
extern volatile uint16_t ADCORE1L __attribute__((__sfr__));
__extension__ typedef struct tagADCORE1LBITS {
  union {
    struct {
      uint16_t SAMC:10;
    };
    struct {
      uint16_t SAMC0:1;
      uint16_t SAMC1:1;
      uint16_t SAMC2:1;
      uint16_t SAMC3:1;
      uint16_t SAMC4:1;
      uint16_t SAMC5:1;
      uint16_t SAMC6:1;
      uint16_t SAMC7:1;
      uint16_t SAMC8:1;
      uint16_t SAMC9:1;
    };
  };
} ADCORE1LBITS;
extern volatile ADCORE1LBITS ADCORE1Lbits __attribute__((__sfr__));

#define ADCORE1H ADCORE1H
extern volatile uint16_t ADCORE1H __attribute__((__sfr__));
__extension__ typedef struct tagADCORE1HBITS {
  union {
    struct {
      uint16_t ADCS:7;
      uint16_t :1;
      uint16_t RES:2;
      uint16_t EISEL:3;
    };
    struct {
      uint16_t ADCS0:1;
      uint16_t ADCS1:1;
      uint16_t ADCS2:1;
      uint16_t ADCS3:1;
      uint16_t ADCS4:1;
      uint16_t ADCS5:1;
      uint16_t ADCS6:1;
      uint16_t :1;
      uint16_t RES0:1;
      uint16_t RES1:1;
      uint16_t EISEL0:1;
      uint16_t EISEL1:1;
      uint16_t EISEL2:1;
    };
  };
} ADCORE1HBITS;
extern volatile ADCORE1HBITS ADCORE1Hbits __attribute__((__sfr__));

#define ADCORE2L ADCORE2L
extern volatile uint16_t ADCORE2L __attribute__((__sfr__));
__extension__ typedef struct tagADCORE2LBITS {
  union {
    struct {
      uint16_t SAMC:10;
    };
    struct {
      uint16_t SAMC0:1;
      uint16_t SAMC1:1;
      uint16_t SAMC2:1;
      uint16_t SAMC3:1;
      uint16_t SAMC4:1;
      uint16_t SAMC5:1;
      uint16_t SAMC6:1;
      uint16_t SAMC7:1;
      uint16_t SAMC8:1;
      uint16_t SAMC9:1;
    };
  };
} ADCORE2LBITS;
extern volatile ADCORE2LBITS ADCORE2Lbits __attribute__((__sfr__));

#define ADCORE2H ADCORE2H
extern volatile uint16_t ADCORE2H __attribute__((__sfr__));
__extension__ typedef struct tagADCORE2HBITS {
  union {
    struct {
      uint16_t ADCS:7;
      uint16_t :1;
      uint16_t RES:2;
      uint16_t EISEL:3;
    };
    struct {
      uint16_t ADCS0:1;
      uint16_t ADCS1:1;
      uint16_t ADCS2:1;
      uint16_t ADCS3:1;
      uint16_t ADCS4:1;
      uint16_t ADCS5:1;
      uint16_t ADCS6:1;
      uint16_t :1;
      uint16_t RES0:1;
      uint16_t RES1:1;
      uint16_t EISEL0:1;
      uint16_t EISEL1:1;
      uint16_t EISEL2:1;
    };
  };
} ADCORE2HBITS;
extern volatile ADCORE2HBITS ADCORE2Hbits __attribute__((__sfr__));

#define ADCORE3L ADCORE3L
extern volatile uint16_t ADCORE3L __attribute__((__sfr__));
__extension__ typedef struct tagADCORE3LBITS {
  union {
    struct {
      uint16_t SAMC:10;
    };
    struct {
      uint16_t SAMC0:1;
      uint16_t SAMC1:1;
      uint16_t SAMC2:1;
      uint16_t SAMC3:1;
      uint16_t SAMC4:1;
      uint16_t SAMC5:1;
      uint16_t SAMC6:1;
      uint16_t SAMC7:1;
      uint16_t SAMC8:1;
      uint16_t SAMC9:1;
    };
  };
} ADCORE3LBITS;
extern volatile ADCORE3LBITS ADCORE3Lbits __attribute__((__sfr__));

#define ADCORE3H ADCORE3H
extern volatile uint16_t ADCORE3H __attribute__((__sfr__));
__extension__ typedef struct tagADCORE3HBITS {
  union {
    struct {
      uint16_t ADCS:7;
      uint16_t :1;
      uint16_t RES:2;
      uint16_t EISEL:3;
    };
    struct {
      uint16_t ADCS0:1;
      uint16_t ADCS1:1;
      uint16_t ADCS2:1;
      uint16_t ADCS3:1;
      uint16_t ADCS4:1;
      uint16_t ADCS5:1;
      uint16_t ADCS6:1;
      uint16_t :1;
      uint16_t RES0:1;
      uint16_t RES1:1;
      uint16_t EISEL0:1;
      uint16_t EISEL1:1;
      uint16_t EISEL2:1;
    };
  };
} ADCORE3HBITS;
extern volatile ADCORE3HBITS ADCORE3Hbits __attribute__((__sfr__));

#define ADEIEL ADEIEL
extern volatile uint16_t ADEIEL __attribute__((__sfr__));
typedef struct tagADEIELBITS {
  uint16_t EIEN0:1;
  uint16_t EIEN1:1;
  uint16_t EIEN2:1;
  uint16_t EIEN3:1;
  uint16_t EIEN4:1;
  uint16_t EIEN5:1;
  uint16_t EIEN6:1;
  uint16_t EIEN7:1;
  uint16_t EIEN8:1;
  uint16_t EIEN9:1;
  uint16_t EIEN10:1;
  uint16_t EIEN11:1;
  uint16_t EIEN12:1;
  uint16_t :1;
  uint16_t EIEN14:1;
} ADEIELBITS;
extern volatile ADEIELBITS ADEIELbits __attribute__((__sfr__));

#define ADEIEH ADEIEH
extern volatile uint16_t ADEIEH __attribute__((__sfr__));
typedef struct tagADEIEHBITS {
  uint16_t :1;
  uint16_t EIEN17:1;
  uint16_t EIEN18:1;
  uint16_t EIEN19:1;
  uint16_t EIEN20:1;
  uint16_t EIEN21:1;
} ADEIEHBITS;
extern volatile ADEIEHBITS ADEIEHbits __attribute__((__sfr__));

#define ADEISTATL ADEISTATL
extern volatile uint16_t ADEISTATL __attribute__((__sfr__));
typedef struct tagADEISTATLBITS {
  uint16_t EISTAT0:1;
  uint16_t EISTAT1:1;
  uint16_t EISTAT2:1;
  uint16_t EISTAT3:1;
  uint16_t EISTAT4:1;
  uint16_t EISTAT5:1;
  uint16_t EISTAT6:1;
  uint16_t EISTAT7:1;
  uint16_t EISTAT8:1;
  uint16_t EISTAT9:1;
  uint16_t EISTAT10:1;
  uint16_t EISTAT11:1;
  uint16_t EISTAT12:1;
  uint16_t :1;
  uint16_t EISTAT14:1;
} ADEISTATLBITS;
extern volatile ADEISTATLBITS ADEISTATLbits __attribute__((__sfr__));

#define ADEISTATH ADEISTATH
extern volatile uint16_t ADEISTATH __attribute__((__sfr__));
typedef struct tagADEISTATHBITS {
  uint16_t :1;
  uint16_t EISTAT17:1;
  uint16_t EISTAT18:1;
  uint16_t EISTAT19:1;
  uint16_t EISTAT20:1;
  uint16_t EISTAT21:1;
} ADEISTATHBITS;
extern volatile ADEISTATHBITS ADEISTATHbits __attribute__((__sfr__));

#define ADCON5L ADCON5L
extern volatile uint16_t ADCON5L __attribute__((__sfr__));
typedef struct tagADCON5LBITS {
  uint16_t C0PWR:1;
  uint16_t C1PWR:1;
  uint16_t C2PWR:1;
  uint16_t C3PWR:1;
  uint16_t :3;
  uint16_t SHRPWR:1;
  uint16_t C0RDY:1;
  uint16_t C1RDY:1;
  uint16_t C2RDY:1;
  uint16_t C3RDY:1;
  uint16_t :3;
  uint16_t SHRRDY:1;
} ADCON5LBITS;
extern volatile ADCON5LBITS ADCON5Lbits __attribute__((__sfr__));

#define ADCON5H ADCON5H
extern volatile uint16_t ADCON5H __attribute__((__sfr__));
__extension__ typedef struct tagADCON5HBITS {
  union {
    struct {
      uint16_t C0CIE:1;
      uint16_t C1CIE:1;
      uint16_t C2CIE:1;
      uint16_t C3CIE:1;
      uint16_t :3;
      uint16_t SHRCIE:1;
      uint16_t WARMTIME:4;
    };
    struct {
      uint16_t C0C1E:1;
      uint16_t C1C1E:1;
      uint16_t C2C1E:1;
      uint16_t C3C1E:1;
    };
  };
} ADCON5HBITS;
extern volatile ADCON5HBITS ADCON5Hbits __attribute__((__sfr__));

